#$#	传递到脚本或函数的参数个数
#$*	以一个单字符串显示所有向脚本传递的参数
#$$	脚本运行的当前进程ID号
#$!	后台运行的最后一个进程的ID号
#$@	与$*相同，但是使用时加引号，并在引号中返回每个参数。
#$-	显示Shell使用的当前选项，与set命令功能相同。
#$?	显示最后命令的退出状态。0表示没有错误，其他任何值表明有错误。

funWithParam(){
    echo "第一个参数为 $1 !"
    echo "第二个参数为 $2 !"
    echo "第十个参数为 $10 !"
    echo "第十个参数为 ${10} !"
    echo "第十一个参数为 ${11} !"
    echo "参数总数有 $# 个!"
    echo "作为一个字符串输出所有参数 $* !"
}
funWithParam 1 2 3 4 5 6 7 8 9 34 73

#下面定义一个带有return语句的函数：

#[ function ] funname [()]
#
#{
#
#    action;
#
#    [return int;]
#
#}